app/controllers/post_books_controller.rb

INSERT INTO "post_books" ("book_name", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_name", "aaa"], ["caption", "sssssss"], ["user_id", 1], ["created_at", "2018-06-12 07:45:26.183944"], ["updated_at", "2018-06-12 07:45:26.183944"]]
---
  def create
  	@post_book = PostBook.new(post_book_params)
  	@post_book.user_id = current_user.id
  	if @post_book.save

SELECT "post_books".* FROM "post_books"
---
  def index
  	@post_books = PostBook.all

SELECT  "post_books".* FROM "post_books" WHERE "post_books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
  	@post_book = PostBook.find(params[:id])

SELECT  "post_books".* FROM "post_books" WHERE "post_books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
  	@post_book = PostBook.find(params[:id])

SELECT  "post_books".* FROM "post_books" WHERE "post_books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "post_books" SET "book_name" = ?, "updated_at" = ? WHERE "post_books"."id" = ?  [["book_name", "aaaaaaaaaaaaa\t\t\t\t"], ["updated_at", "2018-06-14 11:53:38.501267"], ["id", 6]]
---
  def update
  	post_book = PostBook.find(params[:id])
  	post_book.update(post_book_params)

SELECT  "post_books".* FROM "post_books" WHERE "post_books"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "post_books" WHERE "post_books"."id" = ?  [["id", 15]]
---
  def destroy
  	post_book = PostBook.find(params[:id])
  	post_book.destroy