app/controllers/users_controller.rb

  def update
  	@user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "913c582b0d164fa6d5c56a492a4224c882badd3651cec435f59d5162a9c5"], ["introduction", "oooooo"], ["updated_at", "2018-06-23 08:59:06.651984"], ["id", 1]]